
phrases = {
    'deadlock':
        'Это не было предусмотрено.',
    'start':
        'Этот бот поможет организовать удобный процесс записи на тренировку.\n'
        'Откройте меню и выберете следующее действие.',
    'cancel':
        'Процедура прервана. Откройте меню и выберете следующее действие.',
    # 1 client_create
    'client_create_fill_first_name':
        'Введите ваше имя.\n\nОно должно быть прадивым, чтобы вашим тренерам '
        'было понятно, что именно вы придете на тренировку.',
    'client_create_fill_last_name':
        'Введите вашу фамилию.\n\nОно должно быть прадивым, чтобы вашим '
        'тренерам было понятно, что именно вы придете на тренировку.',
    'client_create_fill_gender':
        'Выберете ваш пол.\n\nЭто поможет нам верно отфильтровать доступные '
        'для вас тренировки.',
}


buttons = {
    'client_create': 'Зарегистрироваться'
}


menu_start = {
    '/cancel': 'Прекратить безобразие 🤨',
    '/registration': 'Регистрация ✏️',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}


menu = {
    '/cancel': 'Прекратить безобразие 🤨',
    '/companies': 'Мои компании 💼',
    '/subscriptions': 'Мои подписки ❤️',
    '/records': 'Мои записи 🏆',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}
