
phrases = {
    'deadlock':
        'Ваше действие не было предусмотрено 😔',
    'start_unknow':
        'Привет 🏆'
        '\n\n'
        'Этот бот поможет организовать удобный процесс записи на тренировку.'
        '\n\n'
        'Для продолжения работы нужно зарегистрироваться 📝'
        'Откройте <b>меню</b> и выберете <b>"Регистрация"</b>',
    'start':
        'Cltdslkjflkdjfashlkfjdhlkj',
    'cancel':
        'Процедура прервана. Откройте меню и выберете следующее действие.',
    # 1 client_create
    'client_create_fill_first_name':
        'Введите ваше имя.\n\nОно должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_first_name_error':
        'Имя должно состоять только из букв, попробуйте еще раз.'
        '\n\nИмя должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_last_name':
        'Введите вашу фамилию.\n\nОно должно быть правдивым, чтобы вашим '
        'тренерам было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_last_name_error':
        'Фамилия должна состоять только из букв, попробуйте еще раз.'
        '\n\nФамилия должна быть правдивой, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_gender':
        'Выберете ваш пол.\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_create_fill_gender_error':
        'Нужно выбрать пол из предложенных вариантов.'
        '\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_create_upload_photo':
        'Загрузите свою фотографию.'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_create_upload_photo_error':
        'Нужно выбрать пол из предложенных вариантов.'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_create_done':
        'Регистрация прошла успешно!',
}


buttons = {
    'client_create': 'Зарегистрироваться',
    'gender_m': 'Мужской',
    'gender_f': 'Женский',
    'cancel': 'Не хочу'

}


menu_start = {
    '/cancel': 'Прекратить безобразие 🤨',
    '/registration': 'Регистрация ✏️',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}


menu = {
    '/cancel': 'Прекратить безобразие 🤨',
    '/companies': 'Мои компании 💼',
    '/subscriptions': 'Мои подписки ❤️',
    '/records': 'Мои записи 🏆',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}
