
phrases = {
    'deadlock':
        'Ваше действие не было предусмотрено 😔',
    'start_unknow':
        'Привет 🏆'
        '\n\n'
        'Этот бот поможет организовать удобный процесс записи на тренировку.'
        '\n\n'
        'Для продолжения работы нужно зарегистрироваться 📝'
        'Откройте <b>меню</b> и выберете <b>"Регистрация"</b>',
    'start':
        'Я уже готов к работе 🫡'
        '\n\n'
        'Откройте меню и выберете нужный вам раздел 💪',
    'cancel':
        'Процедура прервана. Откройте меню и выберете следующее действие.',
    'learn':
        'Я помогу Вам организовать процесс записи на тренировку 👍'
        '\n\n'
        'Мой функционал обширен 😏'
        '\n\n'
        'Вы можете открыть меню и начать исследовать всё самостоятельно 🤩'
        '\n\n'
        'Однако, существует сайт с подробным и красочным описанием моих '
        'возможностей.'
        '\n\n'
        '<a href="https://ya.ru">Вот этот сайт</a>',
    'profile':
        '<b>Ваш профиль</b>'
        '\n\n'
        'Имя: {first_name}\n'
        'Фимилия: {last_name}'
        '\nПол: {sex}'
        '\nКол-во компаний: {companies_count}'
        '\nКол-во подписок: {subs_count}',
    'gender_m': 'Мужской',
    'gender_f': 'Женский',
    'support':
        'Перейдите в чат с поддержкой. '
        '\n\n'
        '<a href="tg://user?id=1258311675">Неравнодушные люди</a>'
        '\n\n'
        'Опишите вашу ситуацию в сообщении.',
    # client_create
    'client_create_fill_first_name':
        'Введите ваше имя.\n\nОно должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_first_name_error':
        'Имя должно состоять только из букв, попробуйте еще раз.'
        '\n\nИмя должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_last_name':
        'Введите вашу фамилию.\n\nОно должно быть правдивым, чтобы вашим '
        'тренерам было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_last_name_error':
        'Фамилия должна состоять только из букв, попробуйте еще раз.'
        '\n\nФамилия должна быть правдивой, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_create_fill_gender':
        'Выберете ваш пол.\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_create_fill_gender_error':
        'Нужно выбрать пол из предложенных вариантов.'
        '\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_create_upload_photo':
        'Загрузите свою фотографию.'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_create_upload_photo_error':
        'Нужно выбрать пол из предложенных вариантов.'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_create_done':
        'Регистрация прошла успешно!',
    # client_update
    'client_update_fill_first_name':
        'Введите ваше имя.\n\nОно должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_update_fill_first_name_error':
        'Имя должно состоять только из букв, попробуйте еще раз.'
        '\n\nИмя должно быть правдивым, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_update_fill_last_name':
        'Введите вашу фамилию.\n\nОно должно быть правдивым, чтобы вашим '
        'тренерам было понятно, что именно Вы придете на тренировку.',
    'client_update_fill_last_name_error':
        'Фамилия должна состоять только из букв, попробуйте еще раз.'
        '\n\nФамилия должна быть правдивой, чтобы вашим тренерам '
        'было понятно, что именно Вы придете на тренировку.',
    'client_update_fill_gender':
        'Выберете ваш пол.\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_update_fill_gender_error':
        'Нужно выбрать пол из предложенных вариантов.'
        '\n\nЭто поможет нам верно отфильтровать доступные '
        'для Вас тренировки.',
    'client_update_upload_photo':
        'Загрузите свою фотографию.'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_update_upload_photo_error':
        'Нужно загрузить именно фото'
        '\n\nЭто поможет Вашим тренерам понять, что именно вы посетили '
        'тренировку.',
    'client_update_done':
        'Профиль успешно изменен! ✅',
    # Companies
    'company_empty':
        'Вы пока не создали ни одну компанию',
    'company_header': 'Ваши компании 🎾🛹\n\n',
    'company_repr':
        '{number}. Название: {name}\n\n'
        '{description}\n\n',
    # Company create
    'company_create_fill_name':
        'Введите название компании ✏️'
        '\n\n'
        'Оно не должно быть длиннее 50 символов ❗️',

    'company_create_fill_name_error':
        'Название должно состоять только из букв, попробуйте еще раз ✏️'
        '\n\n'
        'Оно не должно быть длиннее 50 символов ❗️',

    'company_create_fill_description':
        'Введите описание для новой компании ✏️'
        '\n\n'
        'Оно не должно быть длиннее 300 символов ❗️',

    'company_create_fill_description_error':
        'Описание должно состоять только из букв, попробуйте еще раз ✏️'
        '\n\n'
        'Оно не должно быть длиннее 300 символов ❗️',

    'company_create_fill_email':
        'Введите ваш email-адрес ✏️'
        '\n\n'
        'Он понадобиться для восстановления доступа или получения '
        'статистики и отчетов по показателям новой компании 🌩',

    'company_create_fill_email_error':
        'Введенные данные не соответствуют правилам составления '
        'email-адресов ❗️'
        'Попробуйте еще раз ✏️'
        '\n\n'
        'Он понадобиться для восстановления доступа или получения '
        'статистики и отчетов по показателям новой компании 🌩',

    'company_create_upload_photo':
        'Загрузите фото для новой компании 🖼'
        '\n\n'
        'Вам и Вашим клиентам будет приятно видеть логотип или '
        'фотографию всей вашей команды ✨✨✨',

    'company_create_upload_photo_error':
        'Нужно загрузить именно фото ❗️\n'
        'Попробуйте еще раз 🖼'
        '\n\n'
        'Вам и Вашим клиентам будет приятно видеть логотип или '
        'фотографию всей вашей команды ✨✨✨',

    'company_create_upload_video':
        'Загрузите видео для новой компании 📹'
        '\n\n'
        'Это может быть небольшой ролик, показывающий все достоинства '
        'Вашей компании 💪',

    'company_create_upload_video_error':
        'Нужно загрузить именно видео ❗️\n'
        'Попробуйте еще раз 📹'
        '\n\n'
        'Это может быть небольшой ролик, показывающий все достоинства '
        'Вашей компании 💪',
    'company_create_done':
        'Компания успешно создана ✅',
    
}


buttons = {
    'client_create': 'Зарегистрироваться',
    'gender_m': 'Мужской',
    'gender_f': 'Женский',
    'fill_cancel_photo': 'Продолжить без фото',
    'fill_cancel_video': 'Продолжить без видео',
    'update_profile': 'Изменить профиль',
    'miss': 'Пропустить шаг',
    'cancel': 'Отмена',
    'manage_company': 'Управлять компанией',
    'back': '<<',
    'forward': '>>',
    'create_company': 'Создать новую компанию',
}


menu_start = {
    # '/cancel': 'Прекратить безобразие 🤨',
    '/registration': 'Регистрация ✏️',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}


menu = {
    # '/cancel': 'Прекратить безобразие 🤨',
    '/profile': 'Мой профиль 🧐',
    '/companies': 'Мои компании 💼',
    '/subscriptions': 'Мои подписки ❤️',
    '/records': 'Мои записи 🏆',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}
