menu_ru = {
    '/profile': 'Мой профиль 🧐',
    '/companies': 'Мои компании 💼',
    '/subscriptions': 'Мои подписки ❤️',
    '/records': 'Мои записи 🏆',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}

menu_en = {
    '/profile': 'Мой профиль 🧐',
    '/companies': 'Мои компании 💼',
    '/subscriptions': 'Мои подписки ❤️',
    '/records': 'Мои записи 🏆',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}

menu_start_ru = {
    # '/cancel': 'Прекратить безобразие 🤨',
    '/registration': 'Регистрация ✏️',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}

menu_start_en = {
    # '/cancel': 'Прекратить безобразие 🤨',
    '/registration': 'Регистрация ✏️',
    '/learn': 'Изучить возможности бота 📚',
    '/support': 'Служба поддержки 🛠',
}
